{
  "id": 5685252034920448,
  "published": true,
  "days": [
    {
      "id": 5677904553836544,
      "name": "3rd March",
      "tracks": [
        {
          "id": 5114954600415232,
          "name": "Room 3",
          "slots": [
            {
              "id": 47474001,
              "start": "09:00",
              "end": "09:15",
              "contents": {
                "type": "BREAK",
                "title": "Keynote"
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 49524001,
              "start": "09:20",
              "end": "10:10",
              "contents": {
                "type": "BREAK",
                "title": "Keynote"
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 48514001,
              "start": "10:30",
              "end": "11:20",
              "contents": {
                "type": "TALK",
                "id": 5664294473564160,
                "title": "Kotlin - Ready for production",
                "description": "Kotlin, a language developed by JetBrains for nearly 5 years is very close to its first release. However, did you know that it's being used in production for over a few years now already? Both inside and outside of JetBrains there are people deploying Kotlin applications for Android platform, for Web Applications and just about any other type of application.\n\n\nWhy are people using it instead of Java or some of the other languages out there? Primarily because it provides significant benefits in terms of conciseness, readability and safety, without some of the drawbacks that adopting a new language has such as a higher learning curve or interoperability with existing code and ecosystems.\n\n\nIn this talk we'll cover some aspects of Kotlin that can really help you in your daily development, focusing on solving issues versus highlighting language features.\n\n\n",
                "creationDate": 1435663060263,
                "authors": [
                  {
                    "id": 24014004,
                    "uuid": "hadihariri",
                    "name": "Hadi Hariri",
                    "avatar": "http://www.gravatar.com/avatar/c2072a8f90f9fe379ca21c3af39a3757",
                    "description": "Software Developer. Creator of many things OSS. Passions includes Web Development and Software Architecture. Authored a couple of books, a few courses and has been speaking at industry events for nearly 15 years. Currently at JetBrains in the Evangelism team, among other things, and spends as much time as he can writing code.\n"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Alternative Languages"
                  ],
                  "Language ": [
                    "Kotlin"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 5
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 49524002,
              "start": "11:30",
              "end": "12:20",
              "contents": {
                "type": "TALK",
                "id": 5630962842992640,
                "title": "On Polymer and smileys...or Polysmileys",
                "description": "One of my favourite things about the web are ASCII smileys. They're sweet, fun and simply make the web a better place. How could anyone not like them ¯_(ツ)_/¯?\n\n\nThis talk is an overdose of smileys, because they're the perfect excuse to get started with Polymer. Polymer is a library built on top of the Web Components standards that helps developers create reusable components for the modern web. And since I know that everybody has been wondering how one could take over the world by creating a suite of Polymer animated emoticon components, we're going to do exactly that.\n\n\n",
                "creationDate": 1436369564955,
                "authors": [
                  {
                    "id": 37444001,
                    "uuid": "carmenpopoviciu",
                    "name": "Carmen Popoviciu",
                    "avatar": "https://lh5.googleusercontent.com/-1FWzIgiUBvg/AAAAAAAAAAI/AAAAAAAADNI/p1m1Aq0WVgg/photo.jpg",
                    "description": "Carmen is a front-end developer and the former organiser of the Dutch AngularJS User Group. She loves Angular and is passionate about its community. She hopes to one day make a difference for the web with the code she writes. If she had superpowers, she would smiley all the things :)"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Web, Mobile & UX"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 14
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 43854001,
              "start": "12:20",
              "end": "13:20",
              "contents": {
                "type": "BREAK",
                "title": "Lunch break"
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 48514002,
              "start": "12:25",
              "end": "12:45",
              "contents": {
                "type": "Quickie",
                "id": 5728447863193600,
                "title": "Speed, scale, query: can NoSQL give us all three?",
                "description": "The NoSQL movement promised availability, redundancy, speed and more but query was always the poor relation. Now, non-relational databases are increasingly attempting to fix the problem of query. In this talk, we'll survey the non-relational landscape to understand where different NoSQL databases have strengths and which use cases each type suits best. Then we'll look at the different strategies the leading NoSQL databases are taking to solve them problem of rich query in a world that previously saw poor query as a necessary trade-off. You'll get an overview of how the data model of NoSQL databases shapes what is possible in terms of query and what trade-offs the architecture of those databases brings out. Can we really have scale, speed and queryability all from one database?",
                "creationDate": 1434034085192,
                "authors": [
                  {
                    "id": 656030,
                    "uuid": "matthewrevell",
                    "name": "Matthew Revell",
                    "avatar": "https://pbs.twimg.com/profile_images/547119992919969792/e426sFT9.jpeg",
                    "description": "Director of Developer Advocacy (EMEA) at Couchbase."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Big Data & Analytics"
                  ],
                  "Language ": [
                    "Big Data & Analytics"
                  ],
                  "Level ": [
                    "Advanced"
                  ]
                },
                "totalVotes": 3
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 50494001,
              "start": "12:50",
              "end": "13:15",
              "contents": {
                "type": "TALK",
                "id": 5735457786691584,
                "title": "App Cloud: Launch Your Apps in no Time",
                "description": "Cloud-native applications are the future. Do you want to bring your innovation to the market in no time and stay focused on developing what matters the most - your application? Then this talk is exactly for you! This talk will give you an overview of why Cloud Foundry is the platform of choice for modern developers. A live demo shows you how to use Swisscom’s Application Cloud technology: https://developer.swisscom.com\n\n\n",
                "creationDate": 1434709527796,
                "authors": [
                  {
                    "id": 2583003,
                    "uuid": "lukaslehmann",
                    "name": "Lukas Lehmann",
                    "avatar": "https://voxxeddays.com/zurich/wp-content/uploads/sites/10/2016/02/FTR_4673color_1.jpg",
                    "description": "Lukas Lehmann leads the Services Engineering stream for Swisscom’s Application Cloud. As a cloud native, he loves developer platforms. That's why he got in contact with Cloud Foundry: In 2013 Swisscom sent him to Pivotal Labs to build the skills needed to run a large scale Cloud Foundry implementation. As co–founder of the Cloud Foundry user group in Switzerland, he is also heavily involved in the whole Swiss cloud community."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Cloud & DevOps"
                  ],
                  "Language ": [
                    "Cloud & DevOps"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 5
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 48534001,
              "start": "13:20",
              "end": "14:10",
              "contents": {
                "type": "TALK",
                "id": 5732004632985600,
                "title": "How to Apply Big Data Analytics and Machine Learning to Real Time Processing",
                "description": "\"Big Data\" is currently a big hype. Large amounts of historical data are stored in Hadoop or other platforms. Business Intelligence tools and statistical computing are used to draw new knowledge and to find patterns from this data, for example for promotions, cross-selling or fraud detection. The key challenge is how these findings can be integrated from historical data into new transactions in real time to make customers happy, increase revenue or prevent fraud.\n\n\n\"Fast Data\" via stream processing is the solution to embed patterns - which were obtained from analyzing historical data - into future transactions in real-time. This session uses several real world success stories to explain the concepts behind stream processing and its relation to Hadoop and other big data platforms. The session discusses how patterns and statistical models of R, Spark MLlib and other technologies can be integrated into real-time processing using open source frameworks (such as Apache Storm, Spark or Flink) or products (such as IBM InfoSphere Streams or TIBCO StreamBase). A live demo shows the complete development lifecycle combining analytics, machine learning and stream processing.",
                "creationDate": 1433955938840,
                "authors": [
                  {
                    "id": 38104001,
                    "uuid": "kaiwahner",
                    "name": "Kai Wähner",
                    "avatar": "http://www.gravatar.com/avatar/a7e3bdbccd2e4651cd94ceea4253d174",
                    "description": "Kai Wähner works as Technical Lead at TIBCO. Kai’s main area of expertise lies within the fields of Integration, Big Data, Analytics, SOA, Microservices, BPM, Cloud Computing, Java EE and Enterprise Architecture Management. He is speaker at international IT conferences such as JavaOne, ApacheCon or OOP, writes articles for professional journals, and shares his experiences with new technologies on his blog (www.kai-waehner.de/blog). Contact: kontakt@kai-waehner.de or Twitter: @KaiWaehner. Find more details and references (presentations, articles, blog posts) on his website: www.kai-waehner.de"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Big Data & Analytics"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 1
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 47474002,
              "start": "14:20",
              "end": "15:10",
              "contents": {
                "type": "TALK",
                "id": 5682553453281280,
                "title": "Anti-fragile Cloud Architectures",
                "description": "Building distributed applications on commodity hardware in the cloud allows to scale almost infinitely but for the price that everything can fail all the time. This talks introduces patterns like circuit-breakers, bulkheads and others to build robust software architectures that embrace failures. Additional techniques like failure-injection testing are introduced to move robust architecture to self-healing and anti-fragile architectures.",
                "creationDate": 1435187911044,
                "authors": [
                  {
                    "id": 33704001,
                    "uuid": "agicemruli",
                    "name": "Agim Emruli",
                    "avatar": "https://www.gravatar.com/avatar/7e983ca06b3bb09286ea83fbedb3c798",
                    "description": "Agim Emruli is a software architect and open-source developer with mimacom. Agim is a frequent open-source contributor and committer in different communities like the Spring.IO. Agim is currently involved in the development of Spring Cloud and helps customers to build microservice based architectures on cloud platforms like Amazon and Cloud Foundry.\n"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Cloud & DevOps"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 6
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 48524001,
              "start": "15:10",
              "end": "15:40",
              "contents": {
                "type": "BREAK",
                "title": "Coffee Break"
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 49524003,
              "start": "15:40",
              "end": "16:30",
              "contents": {
                "type": "TALK",
                "id": 5661312021430272,
                "title": "Faster Java by Adding Structs (Sort Of)",
                "description": "The ObjectLayout package provides a set of data structure classes designed with optimised memory layout in mind. In languages like C and C++, the use of structs and explicit pointers can deliver high performance for data access through hardware optimisations for caching and pre-fetching. Java's use of implicit pointers, mutable arrays and general inheritance forces the use of reference lookups whenever an object needs to be accessed.\n\n\nThis session will look at the ObjectLayout package (www.objectlayout.org) which provides a new set of APIs that are aimed at matching the natural speed benefits similar data structure constructs enable in most C-style languages while maintaining an idiomatic Java feel and a natural fit with existing code and libraries.\n\n\nThe session will talk through the need for these APIs then describe how they work in practice. We'll also look at how the JVM can further optimise the implementation of the API by making this intrinsic.\n\n\n",
                "creationDate": 1443780971701,
                "authors": [
                  {
                    "id": 50644001,
                    "uuid": "simonritter",
                    "name": "Simon Ritter",
                    "avatar": "https://pbs.twimg.com/profile_images/1900896481/SimonRitter_400x400.jpg",
                    "description": "Simon Ritter is the European CTO of Azul Systems. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K.\n\n\nOriginally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time, he started working with Java technology and has spent time working both in Java development and consultancy. Having moved to Oracle as part of the Sun acquisition he focused on developer outreach for the core Java platform, Java for client applications and embedded Java. Now at Azul he is helping people to understand Azul’s Java virtual machine technologies and products.\n"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Java"
                  ],
                  "Language ": [
                    "JAVA and JVM languages"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 0
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            },
            {
              "id": 49534001,
              "start": "16:40",
              "end": "17:30",
              "contents": {
                "type": "TALK",
                "id": 5661312021430272,
                "title": "What is Pure Functional programming, and how it can improve our application testing?",
                "description": "Pure functional programming is helping developers developing more robust and simpler programs, but it also helps them testing the behaviour of their application in a more predictable way. There are many different approaches to testing and verification of code, and we're constantly reconsidering the best approach to make our code solid, by leveraging concepts like referential transparency and purity to help us avoiding bugs. We explore the meaning of testing, by starting from the simple unit test, moving on to the property based testing and encoding our program invariants in types, with an introduction of some advanced type system concepts such as dependent types.\n\n\n",
                "creationDate": 1443780971701,
                "authors": [
                  {
                    "id": 50644001,
                    "uuid": "lucamolteni",
                    "name": "Luca Molteni",
                    "avatar": "https://en.gravatar.com/userimage/838060/9eeebcd04ce58d16c1c528d64ffff3b4.jpg?size=512",
                    "description": "Luca Molteni is a Software Engineer in love with Functional Programming since 2007.\n\n\nHe's very active in the Milan software developers communities, helping managing the Haskell ITA group and the Java User Group since 2010\n"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Agility, Methodology & Tests"
                  ],
                  "Language ": [
                    "Agility, Methodology & Tests"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 0
              },
              "userId": 36484001,
              "trackId": 5114954600415232
            }
          ]
        },
        {
          "id": 5146912378322944,
          "name": "Room 7",
          "slots": [
            {
              "id": 43004005,
              "start": "10:30",
              "end": "11:20",
              "contents": {
                "type": "TALK",
                "id": 5681237582675968,
                "title": "Modern SQL: A lot has changed in 24 years",
                "description": "SQL seems to have gone out of fashion lately—partly due to the NoSQL movement, but mostly because SQL is still used like 20 years ago. As a matter of fact, SQL continued to evolve during the past decades resulting in the current standard of 2011. In this session, we will go through the most important additions since the widely known SQL-92 and explain how the new features work in common use-cases. Among others, we will see how to organize complex queries for better maintainability, how to use analytic functions to calculate running totals, rankings and median. Finally we will have a quick look at the so-called temporal features of SQL:2011 that allow you to query data “as of” a specific time.",
                "creationDate": 1433744859853,
                "authors": [
                  {
                    "id": 33484001,
                    "uuid": "markuswinand",
                    "name": "Markus Winand",
                    "avatar": "https://www.gravatar.com/avatar/af90fb86a7b586e5b47811d476561cc9",
                    "description": "Markus Winand teaches efficient SQL. He covers both aspects: the development time to accomplish a task using SQL as well as the runtime of the final statement. He also published the book “SQL Performance Explained“ and blogs at http//modern-sql.com."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Big Data & Analytics"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 14
              },
              "userId": 36484001,
              "trackId": 5146912378322944
            },
            {
              "id": 43854007,
              "start": "11:30",
              "end": "12:20",
              "contents": {
                "type": "TALK",
                "id": 5746386733629440,
                "title": "'Bootiful' Applications with Spring Boot",
                "description": "Alright, so maybe \"bootiful\" won't ever work, but I tried, and it was worth it too because you're reading this. Spring Boot, the new convention-over-configuration centric framework from the Spring team at Pivotal, marries Spring's flexibility with conventional, common sense defaults to make application development not just fly, but pleasant! Spring Boot aims to make address the common functional and non-functional requirements that gate quickly moving to production.\n\n\nJoin Spring developer advocate Josh Long for a look at what Spring Boot is, why it's turning heads, why you should consider it for your next application (REST, micro services, web, batch, big data, integration, whatever!) and how to get started.",
                "creationDate": 1443615690140,
                "authors": [
                  {
                    "id": 50614004,
                    "uuid": "joshlong",
                    "name": "Josh Long",
                    "avatar": "https://lh3.googleusercontent.com/-_6iPES14r20/AAAAAAAAAAI/AAAAAAABKk8/X0OuM1WdMwo/photo.jpg",
                    "description": "http://spring.io/team/jlong"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Java"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 0
              },
              "userId": 36484001,
              "trackId": 5146912378322944
            },
            {
              "id": 43854006,
              "start": "12:20",
              "end": "13:20",
              "contents": {
                "type": "LUNCH BREAK",
                "trackId": 5114954600415232
              },
              "userId": 36484001,
              "trackId": 5146912378322944
            },
            {
              "id": 49534002,
              "start": "12:25",
              "end": "12:45",
              "contents": {
                "type": "TALK",
                "id": 5182352435183616,
                "title": "Insert your credit card number here - Improving UX for a better checkout process",
                "description": "The core of a transactional website is to encourage customers to go through the checkout process and effectively convert, bringing revenue to a company. This talk aims to present a quick checklist of many things that can be done to optimize the checkout process.",
                "creationDate": 1435572748911,
                "authors": [
                  {
                    "id": 34214002,
                    "uuid": "myriamjessier",
                    "name": "Myriam Jessier",
                    "avatar": "https://lh4.googleusercontent.com/809JvENkc1pP5CqMW2IdarLctMTVCwZ1WckqcjIiBO8=w514-h685-no",
                    "description": "I'm a digital strategist - behind the abstract title, I spend my time defining a vision, goals and tactics to ensure that a company makes the best use of digital channels available to it. I care deeply about SEO, accessibility and making websites that don't suck."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Web, Mobile & UX"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 9
              },
              "userId": 36484001,
              "trackId": 5146912378322944
            },
            {
              "id": 43854008,
              "start": "12:50",
              "end": "13:15",
              "contents": {
                "type": "TALK",
                "id": 5632184761188352,
                "title": "Lambda core - hardcore",
                "description": "For about a year now – so called lambda expressions can be used by Java developers. But what does it mean... Lambda? The talk will be about story behind, from a little bit more scientific point of view. Church Lambda calculus, Entscheidungsproblem and incompleteness theorem. However, almost all of that will be presented in Java. There are going to be shown some very crazy code pieces such as infinite lazy lists and perfectly unusable implementation of Boolean (based on Lambda expressions).\n",
                "creationDate": 1434443037490,
                "authors": [
                  {
                    "id": 36254001,
                    "uuid": "jarekratajski",
                    "name": "Jarek Ratajski",
                    "avatar": "https://pbs.twimg.com/profile_images/477177747702177793/hwajh68n_400x400.png",
                    "description": "Jarek Ratajski JOAT Developer\n\nJava Developer since 1999. I love programming since my first line of code I did on the C64 in Basic. I have 15 Years experience developing JEE software working for various companies and projects. Currently I am working for CSS Versicherung in Luzern. I do design, lead teams and provide coaching and training inside company. I like to present my experience in public (Wroclaw JUG, DevCrowd 2013, 33rdDegre, Geecon, Capgemini Tech Talks). I like to do shows - presenting the things just as they work – with live coding, demos and hacking."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Java"
                  ],
                  "Language ": [
                    "Java"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 11
              },
              "userId": 36484001,
              "trackId": 5146912378322944
            },
            {
              "id": 43864003,
              "start": "13:20",
              "end": "14:10",
              "contents": {
                "type": "TALK",
                "id": 5718802306170880,
                "title": "expect(shit).length.toBe(1)",
                "description": "There are few topics in technology that are as devious as text handling: Most of the time, we developers got away with «it just works», but as time has progressed, we run into more and more issues where stuff doesn't work and sometimes we don't understand why.\n\n\nIn his talk, Philip is going to dig into the depths of character encodings and Unicode to show how the models we have in our minds about text are often wrong to some surprising (and funny) effects. We'll talks about many contemporary languages and we'll show how only a small minority gets it right - if getting it right is even possible.",
                "creationDate": 1436030863385,
                "authors": [
                  {
                    "id": 34614001,
                    "uuid": "philiphofstetter",
                    "name": "Philip Hofstetter",
                    "avatar": "http://www.gravatar.com/avatar/2d1bbaec0b4bd99a751dcda620fa3698",
                    "description": "Philip is passionate about programming ever since his parents finally allowed him access to a machine in the mid 90ies. Since then he has co-founded Sensational AG in 2000 where he's working as the technical lead."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Web, Mobile & UX"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 6
              },
              "userId": 36484001,
              "trackId": 5146912378322944
            },
            {
              "id": 44794001,
              "start": "14:20",
              "end": "15:10",
              "contents": {
                "type": "TALK",
                "id": 5707811216424960,
                "title": "G1 Garbage Collector: details and tuning",
                "description": "The G1 Garbage Collector is the low-pause replacement for CMS, available since JDK 7u4. This session will explore in details how the G1 garbage collector works (from region layout, to remembered sets, to refinement threads, etc.), what are its current weaknesses, what command line options you should enable when you use it, and advanced tuning examples extracted from real world applications.",
                "creationDate": 1436341750195,
                "authors": [
                  {
                    "id": 32044001,
                    "uuid": "simonebordet",
                    "name": "Simone Bordet",
                    "avatar": "https://lh4.googleusercontent.com/-KaC92DycxYw/AAAAAAAAAAI/AAAAAAAAANM/Q3Zt1zrnkZo/photo.jpg",
                    "description": "Simone Bordet is a Jetty Committer, the CometD project leader and works as Lead Architect at Webtide, the Jetty Company. Active open source developer, he founded and contributed to various open source projects such as Jetty, CometD, MX4J, Foxtrot, LiveTribe, and others. Simone has been technical speaker at various national and international conferences such as Devoxx, JavaOne, CodeMotion, etc., and is a co-lead of the Java User Group of Torino, Italy. Simone specializes in server-side multi-thread development, J2EE application development, in Comet technologies applied to web development, web network protocols (HTTP, WebSocket, SPDY, HTTP/2) and in high performance JVM tuning."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Java"
                  ],
                  "Language ": [
                    "Java"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 0
              },
              "userId": 36484001,
              "trackId": 5146912378322944
            },
            {
              "id": 50504003,
              "start": "15:40",
              "end": "16:30",
              "contents": {
                "type": "TALK",
                "id": 5640868782407680,
                "title": "Rise of the Machines - Automate Your Development",
                "description": "When we talk about automation in software development, we immediately think of automated builds and deployments. We may also be using scripts to help make our daily work easier. But this is really just the beginning of the rise of the machines. I show you how leading developers in our industry are using open source and commercial tools for automating much more. They've got \"robots\" for monitoring production servers, updating issues, supporting customers, reviewing code, setting up laptops, doing development reporting, conducting customer feedback -- even automating daily standups. In what instances is it useful to automate? In what cases does it not make sense? Automation prevents us from having to do the same thing twice, helps us to work better together, reduces workflow errors and frees up time to write production code. Plus, as it turns out, spending time on automation is fun! Don't be afraid of robots in software development, embrace them! Even if I save you just half an hour a week, this talk will be a beneficial investment of your time.",
                "creationDate": 1435907412804,
                "authors": [
                  {
                    "id": 36394001,
                    "uuid": "svenpeters",
                    "name": "Sven Peters",
                    "avatar": "http://www.gravatar.com/avatar/610be07888ce00983ed435ca575efe41",
                    "description": "Sven is a software geek working as an Evangelist for Atlassian. He started with Java development in 1998 and has been programming for longer that he'd like to admit. Besides coding his passion is getting the right tools into the hands of those who need it to help build fast moving, agile, autonomous teams and getting them to kick-ass. Sven has extensive speaking experience in 25+ countries on myriad topics."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Agility, Methodology & Tests"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 5
              },
              "userId": 36484001,
              "trackId": 5146912378322944
            },
            {
              "id": 49524004,
              "start": "16:40",
              "end": "17:30",
              "contents": {
                "type": "TALK",
                "id": 5640868782407680,
                "title": "The reactor programming model for composable distributed computing",
                "description": "The actor model has long been a model of choice for building reliable distributed systems. On one hand, it ensures that message-processing is serialized within each actor, preserving the familiar sequential programming model. On the other hand, programs written in the actor model are location-transparent. The model is sufficiently low-level to express arbitrary message protocols. Composing these protocols is the key to high-level abstractions. Unfortunately, it is difficult to reuse or compose message protocols with actors.\n\n\nReactors simplify protocol composition with first-class typed channels and event streams. In this talk, I will use the Reactors framework to compare the reactor and the actor models on concrete Scala programs. I will show specific obstacles for composition in the classic actor model, and how to overcome them. I will then show how to build reusable, composable distributed computing components in the new model.",
                "creationDate": 1435907412804,
                "authors": [
                  {
                    "id": 36394001,
                    "uuid": "aleksandarprokopec",
                    "name": "Aleksandar Prokopec",
                    "avatar": "https://www.gravatar.com/avatar/e9bdb4fada7e635fffb5e6f26e70cd1d",
                    "description": "Aleksandar Prokopec is a software developer, and a concurrent and distributed programming researcher. He obtained a PhD in Computer Science from the Ecole Polytechnique Federale de Lausanne, Switzerland. As a doctoral assistant and member of the Scala team at EPFL, he contributed to the Scala programming language, and worked on programming abstractions for concurrency, data-parallel programming support, and concurrent data structures for Scala. He created the Scala Parallel Collections framework, which is a library for high-level data-parallel programming in Scala, and participated in working groups for Scala concurrency libraries such as ScalaSTM, and Futures and Promises."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Cloud & DevOps"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 5
              },
              "userId": 36484001,
              "trackId": 5146912378322944
            }
          ]
        },
        {
          "id": 5680862712561664,
          "name": "Room 2",
          "slots": [
            {
              "id": 43014002,
              "start": "10:30",
              "end": "11:20",
              "contents": {
                "type": "TALK",
                "id": 5739439758245888,
                "title": "Parallel Streams: A look under the hood",
                "description": "With Java 8 and its Stream API, we have seen a brand new way of processing collections of data.\n\n\nOne of the most powerful features of the Java8 Streams is its possibility of paralellize the operations pipeline. But, in some cases, there has been several developers which has found that not always the parallel stream works better than the serial stream (or even the traditional for or foreach loops to iterate over a collection).\n\n\nIn this talk we will take a look at the Streams performance and we will present some of the elements that could affect the performance.\n\n\nWe will also present the mechanisms under the Parallel Stream in order to know better the way it works and to try to understand what could affect to the performance of a parallel stream\n",
                "creationDate": 1444132525798,
                "authors": [
                  {
                    "id": 5148433803378688,
                    "uuid": "davidgomezgarcia",
                    "name": "David Gómez García",
                    "avatar": "https://lh6.googleusercontent.com/-b95lQKC6qqw/AAAAAAAAAAI/AAAAAAAAITw/8K88eRYMi6k/photo.jpg",
                    "description": "David Gómez works as Software engineer at Autentia. With more than 15 years of experience in software development, has been part, lead, and developed projects for Banking, Insurance, Defense and Sea & ground transportation business.\n\n\nAside of software development he is also dedicated to training, beeing a SringSource Certified Instructor and also delivers the JavaSpecialists Master courses in Spain. In fact, he has delivered more than 50 training courses all over spain from 2009 to the date.\n\n\n"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Java"
                  ],
                  "Language ": [
                    "Java"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 0
              },
              "userId": 36484001,
              "trackId": 5680862712561664
            },
            {
              "id": 44784002,
              "start": "11:30",
              "end": "12:20",
              "contents": {
                "type": "TALK",
                "id": 5632536545853440,
                "title": "Reactive Apps with Akka and AngularJS",
                "description": "Akka and AngularJS are a great combination for Reactive Apps. Akka takes care of vertical and horizontal scaling as well as resilience and with AngularJS it's easy to implement a rich and highly responsive UI talking to an Akka backend via messages. In this session we will build an exemplary Reactive App step by step: starting from the stanalone UI we first introduce Akka HTTP and Server-Sent Events running on a single node and then move on to an elastic and resilient service built with features like Akka Distributed Data (CRDTs), Akka Cluster Sharding and Akka Persistence.\n",
                "creationDate": 1435601751982,
                "authors": [
                  {
                    "id": 5681275767619584,
                    "uuid": "heikoseeberger",
                    "name": "Heiko Seeberger",
                    "avatar": "https://www.gravatar.com/avatar/33e440a0b5d5f4c6d961fd91dc243296",
                    "description": "Fellow at codecentric. Scala and Akka advocate, Rust enthusiast. Free climber and half marathon runner. FC Bayern München supporter."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "Spanish"
                  ],
                  "Technology": [
                    "Alternative Languages"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 31
              },
              "userId": 36484001,
              "trackId": 5680862712561664
            },
            {
              "id": 49544004,
              "start": "12:25",
              "end": "12:45",
              "contents": {
                "type": "TALK",
                "id": 6324916815134720,
                "title": "Build a Middleware for a RESTful world on top of vert.x",
                "description": "In a RESTful world there is no need for fat, cumbersome Enterprise Service Busses. At Post we developed a Middleware on top of vert.x, an event driven, non blocking platform. In this talk you will learn the basics of vert.x and how to build a middleware on top of this beautiful platform. At Post we needed a solution to dispatch 1’000’000 Requests per day, which we receive from internal mobile applications. The non blocking architecture of vert.x allowed us to build a framework which can do this work with minimal resources. At the heart is a rest-storage which allows, to store data based on the scheme of URL’s. This rest-storage is needed to serve configurations, web content and can also be used as cache, in conjunction with redis. The solution includes: routing, security, usermanagement, queueing, a broadcast system based on URL’s and monitoring.\n",
                "creationDate": 1435610728277,
                "authors": [
                  {
                    "id": 32594002,
                    "uuid": "laurentbovet",
                    "name": "Laurent Bovet",
                    "avatar": "http://www.gravatar.com/avatar/208be5b9b03ac0e078d852f0fb00cf53",
                    "description": "Software developer and architect at Swiss Post, Laurent spent most of its working time since 1999 building applications and frameworks. Mostly in Java, C++ and Python. He now focuses on modern integration spanning from web to backend involving REST APIs, reactive design, micro-service containers and transpiling.\n"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Quickie"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Java"
                  ],
                  "Language ": [
                    "Java"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 6
              },
              "userId": 36484001,
              "trackId": 5680862712561664
            },
            {
              "id": 44774004,
              "start": "12:50",
              "end": "13:15",
              "contents": {
                "type": "TALK",
                "id": 5748405368258560,
                "title": "Writing documentation with Asciidoctor",
                "description": "Asciidoctor is a comprehensive, user-friendly publishing toolchain for the AsciiDoc writing format that uses the AsciiDoc markup language (similar to Markdown or Textile). The Asciidoctor platform is both open source and easy to use. Therefore, several projects at the Eclipse foundation as well as other open source projects such as the Spring getting started guides and the OpenShift project have adopted Asciidoctor to reduce the pain when writing documentation.\n\nAfter a quick overview of the AsciiDoc language, the talk will focus of the pattern that can be used to solve some of the recurrent problems encountered with documentation:\nHow do I handle source code snippets and ensure that they stay up-to date?\nHow do I single source different documentation? (Reuse of text blocs)\nWhat are the requested tools and why does it matter?\nHow do I have reproducible builds for my documentation?\nHow do I get feedback from my community/users?\nThis talk focuses on practical examples from the real world usage in the Eclipse Scout project and will be illustrated with live demonstrations.",
                "creationDate": 1435693947657,
                "authors": [
                  {
                    "id": 40254001,
                    "uuid": "jeremiebresson",
                    "name": "Jérémie Bresson",
                    "avatar": "http://gravatar.com/avatar/7c4c4a3d249b712651df3a1d1c28ab97",
                    "description": "I am a software developer, occasional contributor in different open-source projects. Part of my job at BSI Business Systems Integration AG is to help and federate the community of the Eclipse Scout project and to contribute to this framework."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Agility, Methodology & Tests"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 15
              },
              "userId": 36484001,
              "trackId": 5680862712561664
            },
            {
              "id": 50494003,
              "start": "13:20",
              "end": "14:10",
              "contents": {
                "type": "TALK",
                "id": 5742070828367872,
                "title": "No more stress with the tests - Stresstesting with Gatling!",
                "description": "Unit-, integration- and UI-tests are nowadays more-or-less standard, but what about load tests? They have a niche existence or become canceled due to budget limits. In many projects, people just execute a bunch of fast but uncontrolled clicks. This type of \"smoke tests\" are not meaningful, not reproducible and thus neither comparable nor useful. In case of a performance bottleneck, the actual cause is not obvious.\n\n\nGatling is about to roll-up this domain. Based on a modern open-source architecture of Scala, Akka and Netty, Gatling works asynchronously and non-blocking and thus with a high performance. The Scala-DSL enables you to create the test scenarios quick and easy. With assertions, global success or failure criteria can be defined and cool and clear reports visualize the results. Comprehensive test scenarios can be created with the usage of the Recorder utility. Thanks to Gatling, there are no more excuses not to run load tests right from the start!\n",
                "creationDate": 1433648045877,
                "authors": [
                  {
                    "id": 5694339984392192,
                    "uuid": "nikokobler",
                    "name": "Niko Köbler",
                    "avatar": "http://www.gravatar.com/avatar/395d9a1bac6f64d04bbd713d5b6bc433",
                    "description": "I'm an independant freelance Software-Architect (iSAQB certified), Developer and Trainer mainly for Java and JavaScript enterprise solutions, integrations and web development. I've been advising and supporting clients across industries, conduct workshops, trainings and architecture reviews. Furthermore I'm a regular speaker at various international tech conferences and I'm writing articles for tech magazines and online portals. As a co-lead, I'm supporting my local Java User Group.\n\nsee also http://www.n-k.de/about/"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Agility, Methodology & Tests"
                  ],
                  "Language ": [
                    "Agility, Methodology & Tests"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 1
              },
              "userId": 36484001,
              "trackId": 5680862712561664
            },
            {
              "id": 43854005,
              "start": "14:20",
              "end": "15:10",
              "contents": {
                "type": "TALK",
                "id": 5764177293475840,
                "title": "AngularJS Security",
                "description": "Since its birth, the Web evolved from a system to share and view scientific documents to a full-blown platform for sophisticated applications. While in the beginning most Web applications were implemented purely on the server-side, modern ones heavily rely on client-side components.\n\n\nAngularJS is the latest addition in this process. Within an Angular application the server is merely a data storage facility with a few additional access checks. The core of the application is running on the client-side.\n\n\nAs Angular is specifically designed to work on the client-side, it attempts to remove the main points of friction for developers. By providing a templating system, two-way bindings and custom directives, DOM interactions can be reduced to a bare minimum.\n\n\nFrom a security point of view this is very interesting as Angular removes the need for using some DOM APIs with very sharp edges (innerHTML, document.write). On the other hand, Angular introduces new ways of approaching application development that are largely unexplored in terms of security.\n\n\nThis talk provides an introduction to Angular security. It first introduces the core design ideas and security principles of AngularJS. Then, based on the experience of the Google Security Team, this talk will cover common security pitfalls that are specific to Angular applications. In general, we will cover Angular's string interpolation functionality, strict auto-escaping templates, URL-based directives and insecure legacy APIs.\n",
                "creationDate": 1435590548068,
                "authors": [
                  {
                    "id": 35454001,
                    "uuid": "sebastianlekies",
                    "name": "Sebastian Lekies",
                    "avatar": "https://pbs.twimg.com/profile_images/684778013678907392/0BYLxBUz_400x400.png",
                    "description": "Sebastian Lekies is an Information Security Engineer at Google and a PhD Student at the Ruhr-University Bochum. His research interests encompass client-side Web application security and Web application security testing. He graduated from University of Mannheim with a M.Sc. in Business Information Systems.\n\n\nAt Google, Sebastian is part of the Security Test Engineering team that develops Google’s internal Web application security scanner and the externally facing Cloud Security Scanner (https://cloud.google.com/tools/security-scanner/). Before joining Google, Sebastian was part of SAP’s Security Research team, where he conducted academic research in the area of client-side Web application security."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Architecture, Performance and Security"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 0
              },
              "userId": 36484001,
              "trackId": 5680862712561664
            },
            {
              "id": 45634003,
              "start": "15:40",
              "end": "16:30",
              "contents": {
                "type": "TALK",
                "id": 5692494691958784,
                "title": "React - A trip to Russia isn't all it seems",
                "description": "Web apps have grown in complexity in recent years. Angular, Backbone and Ember are fully fledged Javascript frameworks that bring a lot of power to the browser. jQuery really simplifies the way we manipulate elements on the page.\n\n\nBut what if your app can be in any of hundreds of different states? How do you transition between each and every possible state of your app? We're quickly being overwhelmed by the complexity of our web apps.\n\n\nIn this talk, you'll learn why we needed a new tool and how we determined that React, the Javascript library from Facebook, is a good fit for certain problems. Josh describes the basics of the library and how you can build quite complex apps from very simple components.",
                "creationDate": 1435663177220,
                "authors": [
                  {
                    "id": 33724002,
                    "uuid": "joshsephton",
                    "name": "Josh Sephton",
                    "avatar": "https://www.gravatar.com/avatar/b9effab9a7a1a2ddb1b2ddb35bbd3a2c",
                    "description": "Josh is a Principal Engineer at 383, a customer experience studio for brands who want to compete in a world of changing customers and competitors. He helps create exceptional customer experiences driven by innovative digital products.\n\n\nHe's created, launched and scaled award winning new experiences for brands such as Hilton Worldwide, HomeServe, England Rugby, Carillion and Hammerson."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Web, Mobile & UX"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 7
              },
              "userId": 36484001,
              "trackId": 5680862712561664
            },
            {
              "id": 43884003,
              "start": "16:40",
              "end": "17:30",
              "contents": {
                "type": "TALK",
                "id": 5692494691958784,
                "title": "Scala for Java developers",
                "description": "This talk shows how to start programming in Scala efficiently in the context of having previous experience with Java or developing software in Java-focused environment.\n\nAre you a Java developer who wants to get into Scala quickly ?\nAre you considering using Scala in your Java-based project ?\nIf the answer to any of these question is yes then this talk is for you and you will learn about:\n\nAdditional features Scala provides\nHow to approach learning Scala\nDevelopment tools\nIntegration with Java\nCode examples",
                "creationDate": 1435663177220,
                "authors": [
                  {
                    "id": 33724002,
                    "uuid": "martinockajak",
                    "name": "Martin Ockajak",
                    "avatar": "https://mandos.hq.sk/photo.jpg",
                    "description": "Martin is a software engineer with over a decade of experience in both enterprise and startup environments. He is interested in many aspects of computing all the way from theoretical computer science to hacking in assembler. His greatest passion is making projects and teams work.\n\n\nLately he has been focusing on promoting good software design practices and functional programming in Scala."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Java"
                  ],
                  "Language ": [
                    "Java"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 7
              },
              "userId": 36484001,
              "trackId": 5680862712561664
            }
          ]
        },
        {
          "id": 5695192468291584,
          "name": "Room 8",
          "slots": [
            {
              "id": 44774005,
              "start": "10:30",
              "end": "11:20",
              "contents": {
                "type": "TALK",
                "id": 5640272587259904,
                "title": "Connecting the Unconnected: IoT Made Simple",
                "description": "Connecting physical devices to the cloud can enhance the user experience. AWS IoT is a new managed service that enables Internet-connected things (sensors, actuators, devices, and applications) to easily and securely interact with each other and the cloud. In this session, we will discuss how constrained devices can send data to the cloud and receive commands back to the device. Devices can securely connect using MQTT, HTTP protocols and developers can leverage several features of AWS IoT such as the Rules Engine and Thing Shadows to quickly and easily build a real connected product. This session will take a practical approach to developing real-world IoT and mobile applications in which the back end is serverless and can scale from one to virtually unlimited users without any infrastructure or servers to manage.\n",
                "creationDate": 1435666441961,
                "authors": [
                  {
                    "id": 37264001,
                    "uuid": "danilopoccia",
                    "name": "Danilo Poccia",
                    "avatar": "https://s3-eu-west-1.amazonaws.com/danilop/Photos/Me/Danilo_Poccia_5_02-15.jpg",
                    "description": "I am Technical Evangelist at Amazon Web Services and I work with startups and companies of any size to support their innovation. In my role, I leverage my experience to help customers bringing their ideas to life using the AWS platform, focusing on technical and business impact of mobile and data analytics. I work with customers throughout Europe and I am a frequent speaker at public events and technical workshops."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Future<?>"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 17
              },
              "userId": 36484001,
              "trackId": 5695192468291584
            },
            {
              "id": 46614005,
              "start": "11:30",
              "end": "12:20",
              "contents": {
                "type": "TALK",
                "id": 5630806479339520,
                "title": "Deploying a dockerized distributed application to Mesos",
                "description": "Why is there so much buzz about Docker ? In the last two years it has become one of the most extended tools used by devs and ops in tech companies.\n\n\nThe advantages offered by an immutable infrastructure, portability of docker containers and the speed of containers to start-up are some of its strengths. Docker is a tool coming from the developer world that will make the release phase simpler and help you doing continuous deployment.\n\n\nIn turn, Mesos is a tool that abstracts and manages cluster resources for you. It can share them across multiple frameworks and facilitates resource fair sharing and data locality.\n\n\nIn this session, I will present some of the advantages of using Mesos and Docker together. We will deploy a distributed web application to the cloud on a Mesos cluster. We will use Marathon to deploy docker containers, HAProxy as load balancer and Mesos DNS for service discovery.",
                "creationDate": 1435574049128,
                "authors": [
                  {
                    "id": 33734001,
                    "uuid": "juliamateo",
                    "name": "Julia Mateo",
                    "avatar": "https://www.gravatar.com/avatar/12a58c7c5b14e83ed8590c463578a3f4",
                    "description": "Julia Mateo is a Software Engineer based in Geneva. After several years in Madrid and Paris, she joins Hortis GRC company in Geneva where she works as a senior java developer and tech leader. She helps development teams in the adoption of Agile techniques and Software Craftsmanship. Julia is very involved in community work leading Duchess Swiss. She often speaks about Java and Continuous Delivery through workshops or formal presentations (Geneva Java User Group, Docker User Group, JBCNConf, CodeMotion)."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Cloud & DevOps"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 15
              },
              "userId": 36484001,
              "trackId": 5695192468291584
            },
            {
              "id": 44794002,
              "start": "12:20",
              "end": "13:20",
              "contents": {
                "type": "LUNCH BREAK",
                "trackId": 5114954600415232
              },
              "userId": 36484001,
              "trackId": 5695192468291584
            },
            {
              "id": 50404005,
              "start": "12:45",
              "end": "13:30",
              "contents": {
                "type": "QUICKIE",
                "id": 5738157576290304,
                "title": "Configuration with Apache Tamaya",
                "description": "Configuration is a number one cross-cutting concern. Apache Tamaya provides a lean, unified API for accessing configuration. Its extensible architecture allows extensions to be loaded by simply adding them to your project, if needed. Tamaya itself ships with lots of functionatlity. This quick talk gives a short overview of Tamaya's design and what you can do with it!\n",
                "creationDate": 1436350237569,
                "authors": [
                  {
                    "id": 33864001,
                    "uuid": "anatoletresch",
                    "name": "Anatole Tresch",
                    "avatar": "https://lh5.googleusercontent.com/-g_uyrIjUiic/AAAAAAAAAAI/AAAAAAAAAAA/3Ul40tdhZQY/photo.jpg",
                    "description": "Anatole has studied information sciences and economics at the University of Zurich and worked several years as a Managing Partner, consultant, lead engineer and technical enterprise architect being able to gain experiences in numerous areas of the Java eco-system, in both, small and large enterprise contexts. Anatole is principal consultant at Trivadis, star specification lead of JSR 354 (Java Money & Currency) and expert member of JSR 365 and 377. Finally Anatole drives Java configuration as founder and PPMC member of the Apache Tamaya configuration project."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Cloud & DevOps"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 0
              },
              "userId": 36484001,
              "trackId": 5695192468291584
            },
            {
              "id": 48544003,
              "start": "12:50",
              "end": "13:15",
              "contents": {
                "type": "QUICKIE",
                "id": 5655330876817408,
                "title": "Automated Functional Testing on the JVM with Geb",
                "description": "The presentation will center on automated functional testing in the Java world, with a particular focus on smoke testing, and how to prevent catastrophic failures from reaching the production environment.\n\n\nWe will show you how we, at CERN, have leveraged Geb -- a Groovy-based browser automation tool built on top of Selenium -- to develop a full suite of smoke tests for CERN's Electronic Document Handling (EDH) system -- a large web application with over 1 million lines of Java code, in production since 1998, which is used to automate as many as 65 administrative processes across all of CERN's key business areas such as safety, procurement, finance, customs, and training.\n\n\nThough the tool is aimed for use on the JVM, the concepts that will be presented can be applied in other languages that have wrappers for Selenium. In particular, patterns that can be used to better describe and structure functional/smoke tests, as well as how to integrate these tests with continuous integration systems, such as Atlassian Bamboo, using headless browsers (e.g. PhantomJS) or virtual frame buffers.",
                "creationDate": 1435154252415,
                "authors": [
                  {
                    "id": 33684001,
                    "uuid": "joaosilva",
                    "name": "João Silva",
                    "avatar": "https://lh4.googleusercontent.com/-gKLS0miONr0/AAAAAAAAAAI/AAAAAAAAADM/o-HuDIVD0js/photo.jpg",
                    "description": "João Silva is a software engineer working for CERN’s e-Business section within the Advanced Information Systems group, responsible for web and workflow applications development. Before joining CERN, he worked as an IT consultant for Accenture, focusing mainly on the design and development of enterprise-wide information systems for the utilities industry."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Agility, Methodology & Tests"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 10
              },
              "userId": 36484001,
              "trackId": 5695192468291584
            },
            {
              "id": 49524005,
              "start": "13:20",
              "end": "14:10",
              "contents": {
                "type": "TALK",
                "id": 5732523787157504,
                "title": "What's new in Spring Data?",
                "description": "This talk will give a broad overview of the new features introduced in the latest Spring Data release trains. We will cover recent additions and improvements in Spring Data Commons - the module that's shared amongst the store specific ones. We'll then delve into the latest and greatest features of individual store modules, like JPA and MongoDB, and the community ones as well.",
                "creationDate": 1435660351091,
                "authors": [
                  {
                    "id": 32624002,
                    "uuid": "olivergierke",
                    "name": "Oliver Gierke",
                    "avatar": "https://www.gravatar.com/avatar/cf0c4a6be78057e020082a8550a8df43",
                    "description": "Oliver Gierke is the lead of the Spring Data project at Pivotal, formerly known as SpringSource, and member of the JPA 2.1 expert group. He has been into developing enterprise applications and open source projects for over 8 years now. His working focus is centered around software architecture, Spring, REST and persistence technologies. He is regularly speaking at German and international conferences and the author of technology articles as well as the first book on Spring Data."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Java"
                  ],
                  "Language ": [
                    "Java"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 1
              },
              "userId": 36484001,
              "trackId": 5695192468291584
            },
            {
              "id": 49534003,
              "start": "14:20",
              "end": "15:10",
              "contents": {
                "type": "TALK",
                "id": 5701530095190016,
                "title": "How usuability fits in UX - it's no PICNIC",
                "description": "For the past 20 years we have developed, designed, marketed with, for and at users. UX and usability are getting a lot of attention within that context. Beyond the buzzwords, we will look at two practices that shape our daily lives. What does it mean for an application to be usable and how's that part of creating an amazing user experience? This talk aims to discuss some actionable developer tips to ensure that your applications resonate with users.",
                "creationDate": 1436129522380,
                "authors": [
                  {
                    "id": 35764001,
                    "uuid": "myriamjessier",
                    "name": "Myriam Jessier",
                    "avatar": "https://lh4.googleusercontent.com/809JvENkc1pP5CqMW2IdarLctMTVCwZ1WckqcjIiBO8=w514-h685-no",
                    "description": "I'm a digital strategist - behind the abstract title, I spend my time defining a vision, goals and tactics to ensure that a company makes the best use of digital channels available to it. I care deeply about SEO, accessibility and making websites that don't suck."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Web, Mobile & UX"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 0
              },
              "userId": 36484001,
              "trackId": 5695192468291584
            },
            {
              "id": 47474006,
              "start": "15:40",
              "end": "16:30",
              "contents": {
                "type": "TALK",
                "id": 5752383715934208,
                "title": "Java Security Architecture Demistified",
                "description": "The session provide an overview of the security architecture of the Java platform in terms of its evolution throughout the versions of the JDK up to JDK 9 and beyond. The security utilities that fullfill the security portfolio of the JDK will be discussed briefly along with several guidelines in designing and implementing secure applications by following security best practices.\n\n\nAgenda: - Evolution of the Java security model - Outside the sandbox - APIs for secure coding - Designing and coding with security in mind\n",
                "creationDate": 1435596522425,
                "authors": [
                  {
                    "id": 36354001,
                    "uuid": "mtoshev",
                    "name": "Martin Toshev",
                    "avatar": "http://www.gravatar.com/avatar/bb548688100c281038596a39e5e85a04",
                    "description": "Martin is a Java enthusiast and one of the leads of the Bulgarian Java Users group (BG JUG). He is a certified Java professional (SCJP6) and a certified IBM cloud computing solution advisor. His areas of interest include the wide range of Java-related technologies (such as Servlets, JSP, JAXB, JAXP, JMS, JMX, JAX-RS, JAX-WS, Hibernate, Spring Framework, Liferay Portal and Eclipse RCP), cloud computing technologies, cloud-based software architectures, enterprise application integration, relational and NoSQL databases. You can reach him for any Java and FOSS-related topics (especially Eclipse and the OpenJDK). Martin is a regular speaker at Java conferences and one of the organizers behind the jPrime conference in Bulgaria (http://jprime.io/)"
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Architecture, Performance and Security"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 19
              },
              "userId": 36484001,
              "trackId": 5695192468291584
            },
            {
              "id": 44794003,
              "start": "16:40",
              "end": "17:30",
              "contents": {
                "type": "TALK",
                "id": 5752383715934208,
                "title": "Swift Reloaded",
                "description": "Apple presented in June 2015 the second iteration of their new programming language suited for OS X, iOS, Watch and TV OS applications.\n\nSwift 2 brings a set of significative improvements over the first iteration: \nprotocol extensions, a powerful extension mechanism which enables, among others, a more consistent notation for operations over collections\n- algebraic data types\n- a proper error handling – as we know it from languages like Java\n- an extended pattern matching syntax\n- and lots of other changes.\n\n\nIn this session I will present an overview of these improvements and show interactively inside a playground how the programming language ticks.\n",
                "creationDate": 1435596522425,
                "authors": [
                  {
                    "id": 36354001,
                    "uuid": "patrickjayet",
                    "name": "Patrick Jayet",
                    "avatar": "https://media.licdn.com/media/p/2/000/125/0df/05998f5.jpg",
                    "description": "Patrick Jayet is software engineer and architect at Zühlke Engineering near Zurich. He conceives and implements enterprise projects in the areas Mobile and iOS, Domain Specific Languages on the JVM, Eclipse RCP and Data Analytics. Patrick leads a focus group at Zühlke which follows the trend in the area of native and cross platform mobile development. Patrick regularly gives workshops about iOS, Swift & Objective-C, his Twitter handle is @xrb."
                  }
                ],
                "state": "ASSIGNED",
                "tags": {
                  "Type of Proposal": [
                    "Talk"
                  ],
                  "Language of the talk/workshop": [
                    "English"
                  ],
                  "Technology": [
                    "Web, Mobile & UX"
                  ],
                  "Language ": [
                    "Other"
                  ],
                  "Level ": [
                    "Intermediate"
                  ]
                },
                "totalVotes": 19
              },
              "userId": 36484001,
              "trackId": 5695192468291584
            }
          ]
        }
      ]
    }
  ]
}
